"""
將星座的資訊存到陣列之中，並提供查詢功能
"""


def get_constellation_list() -> []:
    """
    回傳12個星座的名字與日期。
    [牡羊座	3月21日～4月20日,
    金牛座	4月21日～5月20日,	
    雙子座	5月21日～6月20日,	
    巨蟹座	6月21日～7月22日,	
    獅子座	7月23日～8月22日,	
    處女座	8月23日～9月22日,	
    天秤座	9月23日～10月22日,	
    天蠍座	10月23日～11月22日,	
    射手座	11月23日～12月22日,	
    魔羯座	12月23日～1月21日,
    水瓶座	1月22日～2月19日,	
    雙魚座	2月20日～3月20日]	
    """
    result = []
    return result


def get_constellation(index: int):
    """
    根據編號回傳特定星座
    ex index =1 回傳 牡羊座	3月21日～4月20日
    """
    return ""
